 
 // ТГ, Начало добавление реквизитов на формы
 
 Процедура ДополнитьФорму(Форма) Экспорт 
	// ТГ, Конец, условия добавления реквизитов на формы
 
	ИмяФормы = Форма.ИмяФормы; 
	 
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
		ДобавитьПолеПроцентВГруппаШапкаЛево(Форма); 
		ДобавитьКомандаПересчитатьВГруппаШапкаЛево(Форма);
	ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоНаформуПередОснование(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоНаформуПередСуммаДокумента(Форма);	
	КонецЕсли;
	// ТГ, Конец, условия добавления реквизитов на формы	 
КонецПроцедуры 



Процедура ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма)
	 // ТГ, Начало, добавление реквизита Контактное лицо на форму
	ПолеВода = Форма.Элементы.Добавить("ТГ_КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);
	ПолеВода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВода.ПутьКДанным = "Объект.ТГ_КонтактноеЛицо";
	 // ТГ, Конец, добавление реквизита Контактное лицо на форму
	
КонецПроцедуры

Процедура ДобавитьПолеКонтактноеЛицоНаформуПередСуммаДокумента(Форма)
	// ТГ, Начало, добавление реквизита Контактное лицо на форму
	ПолеВода = Форма.Элементы.Вставить("ТГ_КонтактноеЛицо", Тип("ПолеФормы"), Форма, Форма.Элементы.СуммаДокумента);
	ПолеВода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВода.ПутьКДанным = "Объект.ТГ_КонтактноеЛицо";
	// ТГ, Конец, добавление реквизита Контактное лицо на форму 	
КонецПроцедуры 

Процедура ДобавитьПолеКонтактноеЛицоНаформуПередОснование(Форма)
	// ТГ, Начало, добавление реквизита Контактное лицо на форму
	ПолеВода = Форма.Элементы.Вставить("ТГ_КонтактноеЛицо", Тип("ПолеФормы"), Форма, Форма.Элементы.Основание);
	ПолеВода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВода.ПутьКДанным = "Объект.ТГ_КонтактноеЛицо";
	// ТГ, Конец, добавление реквизита Контактное лицо на форму 	
КонецПроцедуры  

Процедура ДобавитьПолеПроцентВГруппаШапкаЛево(Форма)
    // ТГ, Начало, добавление реквизита Процент на форму и обозначение действия при изменении
	ПолеВода = Форма.Элементы.Добавить("ТГ_Процент", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаЛево);
	ПолеВода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВода.ПутьКДанным = "Объект.ТГ_Процент";
	ПолеВода.УстановитьДействие("ПриИзменении", "ПроцентПриИзмененииПосле");
	// ТГ, Конец, добавление реквизита Процент на форму и обозначение действия при изменении
 	 	
КонецПроцедуры
                                      
Процедура ДобавитьКомандаПересчитатьВГруппаШапкаЛево(Форма)
	// ТГ, Начало, добавление команды "Пересчитать" на форму
	ПолеВода = Форма.Элементы.Добавить("Пересчет", Тип("КнопкаФормы"), Форма.Элементы.ГруппаШапкаЛево);
	ПолеВода.ИмяКоманды = "Пересчитать";
	 // ТГ, Конец, добавление команды "Пересчитать" на форму	
КонецПроцедуры

// ТГ, Конец, добавление реквизитов на формы

